

export const indexSpeedObject = {
    'B': 50,
    'C': 60,
    'D': 65,
    'E': 70,
    'F': 80,
    'G': 90,
    'J': 100,
    'K': 110,
    'L': 120,
    'M': 130,
    'N': 140,
    'P': 150
}


export const objectDiscription = {
    'pressureHigh': ['Неравномерный износ (повышенное истирание центральной части протектора)',
        'Снижение сопротивления к проколам и другим повреждениям', 'Вероятность появления пилообразного износа (для блочного типа рисунка протектора)',
        'Уменьшение комфортности вождения', 'Увеличение риска повреждения элементов подвески автомобиля', 'Снижение управляемости автомобилем'],
    'pressureLow': ['Неравномерный износ (повышенное истирание боковых зон протектора)', 'Повышенный расход топлива',
        'Риск изменения структуры резиновой смеси (в результате высоких температур) и расслоения',
        'Отслоение в надбортовой зоне (раскрытие заворота каркаса)', 'Повышенный износ в зоне контакта с ободом',
        'Снижение управляемости автомобилем'],
    'speeding': ['Увеличенный износ шины', 'Потеря устойчивости и управляемости', 'Риск аварийных ситуаций']
}


export const objColors = {
    5: 'rgba(5, 159, 16, 0.8)',//#009933',//зеленый
    4: 'rgba(5, 159, 16, 0.8)',//#009933', //зеленый
    3: 'rgba(200, 202, 8, 0.8)',//#FFFF00',//желтый
    2: 'rgba(205, 95, 5, 0.8)',//#FF6633',//оранж
    1: 'rgba(209, 3, 13, 0.8)'///'#FF0000'//красный
}

